app/controllers/upload_files_controller.rb

  def index
    @upload_files = UploadFile.all
---
SELECT "upload_files".* FROM "upload_files"

  def create
    @upload_file = UploadFile.new(upload_file_params)

    respond_to do |format|
      if @upload_file.save
---
INSERT INTO "upload_files" ("zip_file_a_file_name", "zip_file_a_content_type", "zip_file_a_file_size", "zip_file_a_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def set_upload_file
    @upload_file = UploadFile.find(params[:id])
---
SELECT  "upload_files".* FROM "upload_files" WHERE "upload_files"."id" = ? LIMIT 1  [["id", 4]]